/*
[백준]
9653, 스타워즈 로고

[문제파악]
스타워즈 로고를 예제 출력과 같이 출력하는 프로그램을 작성하시오.

[출력]
스타워즈 로고를 출력한다.

*/


public class Main {
    public static void main(String[] args) {
        System.out.println("    8888888888  888    88888\n"
                        + "   88     88   88 88   88  88\n"
                        + "    8888  88  88   88  88888\n"
                        + "       88 88 888888888 88   88\n"
                        + "88888888  88 88     88 88    888888\n"
                        + "\n"
                        + "88  88  88   888    88888    888888\n"
                        + "88  88  88  88 88   88  88  88\n"
                        + "88 8888 88 88   88  88888    8888\n"
                        + " 888  888 888888888 88  88      88\n"
                        + "  88  88  88     88 88   88888888\n");
    }
}